# Projet maison n° 3

In [49]:
# imports
import pandas as pd

## 1. US baby names

On va s'intéresser au dataset **National data** de la SSA : https://www.ssa.gov/oact/babynames/limits.html

1. Télécharger le dataset des prénoms US : https://www.ssa.gov/oact/babynames/names.zip

2. Implémenter une fonction Python qui produit un unique DataFrame avec tous les fichiers en utilisant pandas  (par ex. fonction \"concat\" ou méthode \"append\"), pas de bash :)

Ordre et noms des colonnes : 'year', 'name', 'gender', 'births'

Le DataFrame doit être trié selon l'année croissante puis selon l'ordre défini par les différents fichiers (voir la documentation ci-dessus).

In [50]:
# 1) implémentation avec glob + append
import glob

def df_names_us():
    df = pd.DataFrame()
    files = glob.glob('names/*.txt')
    files.sort()
    for filename in files:
        csv = pd.read_csv(filename,
                          names=['name', 'gender', 'births'])
        csv['year'] = int(filename[-8:-4]) # yobAAAA.txt
        df = df.append(csv, ignore_index=True)
    df = df[['year', 'name', 'gender', 'births']]
    return df

In [51]:
%%time
df_us = df_names_us()
df_us.shape

CPU times: user 4.52 s, sys: 1.6 s, total: 6.13 s
Wall time: 6.46 s

(2020863, 4)

In [52]:
# head
df_us.head()

   year       name gender  births
0  1880       Mary      F    7065
1  1880       Anna      F    2604
2  1880       Emma      F    2003
3  1880  Elizabeth      F    1939
4  1880     Minnie      F    1746

In [53]:
# 2) implémentation avec range + concat
def df_names_us():
    dfs = []
    for year in range(1880, 2021):
        csv = pd.read_csv(f'names/yob{year}.txt',
                          header=None,
                          names=['name', 'gender', 'births'])
        csv['year'] = year
        dfs.append(csv)
    df = pd.concat(dfs, ignore_index=True)
    df = df[['year', 'name', 'gender', 'births']]
    return df

In [54]:
%%time
df_us = df_names_us()
df_us.shape

CPU times: user 1.48 s, sys: 334 ms, total: 1.82 s
Wall time: 1.89 s

(2020863, 4)

In [55]:
# head
df_us.head()

   year       name gender  births
0  1880       Mary      F    7065
1  1880       Anna      F    2604
2  1880       Emma      F    2003
3  1880  Elizabeth      F    1939
4  1880     Minnie      F    1746

## 2. Prénoms français

On va s'intéresser au dataset **Fichiers France hors Mayotte** de l'INSEE :  https://www.insee.fr/fr/statistiques/2540004/

L'idée est de charger les données et ensuite de les conformer au DataFrame des prénoms US. Ainsi, toute manipulation sur le DataFrame des prénoms US pourra être directement réutilisée avec le DataFrame des prénoms français.
 
1. Télécharger le dataset des prénoms français : https://www.insee.fr/fr/statistiques/fichier/2540004/nat2019_csv.zip


Lire la documentation, ça peut être utile...
 
2. Implémenter une fonction Python qui produit un DataFrame avec les prénoms français en prenant le DataFrame des prénoms US comme modèle :
 
 - Même ordre et mêmes noms des colonnes : year, name, gender, births
 - Mêmes dtypes pour les colonnes
 - Mêmes valeurs pour la colonne 'gender'
 - Seuls les prénoms de 2 caractères et plus sont conservés
 - La casse des prénoms doit être identique : initiales en majuscule, autres lettres en minuscule
 - Les lignes avec des données inutilisables doivent être supprimées
 - Les données sont triées à l'identique : années (↑), puis gender (↑), puis births (↓) et enfin name (↑)
 - L'index du DataFrame doit aller de 0 à N-1

In [56]:
def df_names_fr():
    # genres
    d = {'1': 'M', '2': 'F'}
    # read_csv
    df = pd.read_csv('nat2020.csv',
                      sep=';',
                      header=0,
                      names=['gender', 'name', 'year', 'births'],
                      converters={
                          'gender': d.get,
                          'name': str.title
                      })
    # clean
    df = df.loc[(df['name'].str.len() > 1)
                & (df['year'] != 'XXXX')
                & ~df['name'].str.startswith('_')]
    # types
    df['year'] = df['year'].astype(int)
    # ordre colonnes
    df = df[['year', 'name', 'gender', 'births']]
    # tri
    df = df.sort_values(['year', 'gender', 'births', 'name'],
                   ascending=[True, True, False, True])
    df = df.reset_index(drop=True)
    
    return df

In [57]:
%%time
df_fr = df_names_fr()
df_fr.shape

CPU times: user 1.38 s, sys: 127 ms, total: 1.51 s
Wall time: 1.53 s

(630407, 4)

In [58]:
# head
df_fr.head()

   year        name gender  births
0  1900       Marie      F   48713
1  1900      Jeanne      F   13981
2  1900  Marguerite      F    8058
3  1900    Germaine      F    6981
4  1900      Louise      F    6696

In [59]:
df_fr.dtypes

year       int64
name      object
gender    object
births     int64
dtype: object

In [60]:
# prénom NA
df_fr.loc[df_fr['name']=='Na']

        year name gender  births
404391  2003   Na      F       3

In [61]:
# impact du converters / name
d = {'1': 'M', '2': 'F'}

df = pd.read_csv('nat2020.csv',
                  sep=';',
                  header=0,
                  names=['gender', 'name', 'year', 'births'],)
                  #converters={
                  #    'gender': d.get,
                  #    'name': str.title
                  #})

df['name'].isnull().sum()

2

In [62]:
df.isnull().any()

gender    False
name       True
year      False
births    False
dtype: bool

In [63]:
df.loc[df['name'].isnull()]

        gender name  year  births
563597       2  NaN  2003       3
563598       2  NaN  XXXX      29

In [64]:
# capitalize
'JEAN-MARIE'.capitalize()

'Jean-marie'

In [65]:
# title
'JEAN-MARIE'.title()

'Jean-Marie'

## 3. Taux de change

On va s'intéresser au dataset des cours des devises de la Banque de France :  http://webstat.banque-france.fr/fr/browseBox.do?node=5385566

L'idée est de charger les données, de les nettoyer et de pouvoir accéder aux cours de certaines devises à partir de leur code ISO3.
 
1. Télécharger le dataset des taux de change : http://webstat.banque-france.fr/fr/downloadFile.do?id=5385698&exportType=csv


2. Implémenter une fonction qui produit un DataFrame avec les taux de change par date pour une liste de codes ISO3 de devises passée en argument. L'index du DataFrame doit correspondre aux dates (voir la fonction pd.to_datetime() avec le format '%d/%m/%Y'). Les colonnes du DataFrame doivent correspondre aux devises.

In [68]:
def df_taux_change(devises):
    df = pd.read_csv("Webstat_Export_20210929.csv",
                     sep=";",
                     na_values='-',
                     decimal=',',
                     skiprows=[0, 1, 3, 4, 5],  # le skiprows permet à l'option "decimal" de fonctionner
                     converters={0: lambda x: pd.to_datetime(x, format='%d/%m/%Y', errors='ignore')})

    # extraction des codes monnaies
    cols = pd.Series(df.columns.tolist()).str.extract('\(([A-Z]{3})\)', expand=True)
    cols.iloc[0] = 'Date'
    df.columns = cols[0]

    # selection des devises
    df = df[['Date'] + devises]

    # drop na
    df = df.dropna()

    # set index
    df = df.set_index('Date')
    
    return df

In [69]:
%%time
df_tx = df_taux_change(['CHF', 'GBP', 'USD'])
df_tx.shape

CPU times: user 1.34 s, sys: 25.5 ms, total: 1.37 s
Wall time: 1.4 s

(5833, 3)

In [70]:
# head
df_tx

0              CHF      GBP     USD
Date
2021-09-28  1.0840  0.85950  1.1678
2021-09-27  1.0850  0.85420  1.1698
2021-09-24  1.0830  0.85703  1.1719
2021-09-23  1.0831  0.85495  1.1715
2021-09-22  1.0820  0.86000  1.1729
...            ...      ...     ...
1999-01-14  1.5934  0.70620  1.1653
1999-01-13  1.5931  0.70840  1.1744
1999-01-12  1.6072  0.70660  1.1520
1999-01-11  1.6104  0.70440  1.1569
1999-01-08  1.6138  0.70940  1.1659

[5833 rows x 3 columns]

In [71]:
df_tx.index

DatetimeIndex(['2021-09-28', '2021-09-27', '2021-09-24', '2021-09-23',
               '2021-09-22', '2021-09-21', '2021-09-20', '2021-09-17',
               '2021-09-16', '2021-09-15',
               ...
               '1999-01-21', '1999-01-20', '1999-01-19', '1999-01-18',
               '1999-01-15', '1999-01-14', '1999-01-13', '1999-01-12',
               '1999-01-11', '1999-01-08'],
              dtype='datetime64[ns]', name='Date', length=5833, freq=None)

### Tests

In [72]:
import unittest

class Lesson4Tests(unittest.TestCase):
    def test_df_names_us(self):
        df = df_names_us()
        # colonnes
        self.assertEqual(list(df.columns), ['year', 'name', 'gender', 'births'])
        # lignes
        self.assertEqual(len(df), 2020863)
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.range.RangeIndex))
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)
        
    def test_df_names_fr(self):
        df = df_names_fr()
        # colonnes
        self.assertEqual(list(df.columns), ['year', 'name', 'gender', 'births'])
        # lignes
        self.assertEqual(len(df), 630407)
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.range.RangeIndex))
        # test names
        self.assertTrue(df.loc[df['name'].str.contains('^[A-Z]+(?:-[A-Z]+)?$')].empty)
        # test gender
        self.assertEqual(len(df), len(df.loc[df['gender']=='F']) + len(df.loc[df['gender']=='M']))
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)

    def test_df_taux_change(self):
        df = df_taux_change(['CHF', 'GBP', 'USD'])
        # colonnes
        self.assertEqual(list(df.columns), ['CHF', 'GBP', 'USD'])
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.datetimes.DatetimeIndex))
        # types taux
        self.assertTrue((df.dtypes == 'float').all())
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)

In [73]:
# run tests
def run_tests():
    test_suite = unittest.makeSuite(Lesson4Tests)
    runner = unittest.TextTestRunner(verbosity=2)
    runner.run(test_suite)

In [74]:
# run tests

run_tests()

test_df_names_fr (__main__.Lesson4Tests) ... ok
test_df_names_us (__main__.Lesson4Tests) ... ok
test_df_taux_change (__main__.Lesson4Tests) ... ok

----------------------------------------------------------------------
Ran 3 tests in 5.988s

OK

### Session 5 - Un peu de Data Science...

**Question n° 1**

Pourquoi le value_counts() du "gender" donne-t-il un tel écart entre F et M ?

In [75]:
# value_counts du gender

df_us['gender'].value_counts()

F    1192115
M     828748
Name: gender, dtype: int64

In [76]:
# value_counts du gender

df_fr['gender'].value_counts()

F    342873
M    287534
Name: gender, dtype: int64

In [77]:
# pct_change

df_us['gender'].value_counts().pct_change()

F         NaN
M   -0.304809
Name: gender, dtype: float64

In [78]:
# pct_change

df_fr['gender'].value_counts().pct_change()

F         NaN
M   -0.161398
Name: gender, dtype: float64

**Question n° 2**

Pourquoi le value_counts() du "name" donne-t-il ce résultat ?

In [79]:
# value_counts du gender

df_us['name'].value_counts().head(16)

Sidney     282
Leslie     282
William    282
Jean       282
Joseph     282
Lee        282
Tommie     282
James      282
Johnnie    282
Francis    282
Ollie      282
Jessie     282
Marion     282
John       282
Jesse      282
Charlie    281
Name: name, dtype: int64

In [80]:
# value_counts du gender

df_fr['name'].value_counts().head(16)

Ange         242
Alix         242
Camille      242
Dominique    238
Claude       235
Hyacinthe    231
Maxime       230
Marie        213
Gaby         210
Cyrille      208
Elie         202
Andréa       201
France       198
Léandre      197
Irène        196
Stéphane     194
Name: name, dtype: int64

**Question n° 3**

Pourquoi le value_counts() du "year" donne-t-il ce résultat ?

In [81]:
# value_counts du gender

df_us['year'].value_counts().head(16)

2008    35084
2007    34964
2009    34715
2006    34096
2010    34085
2011    33919
2012    33761
2013    33304
2014    33269
2015    33145
2016    33031
2017    32634
2005    32554
2018    32178
2004    32051
2019    32030
Name: year, dtype: int64

In [82]:
# value_counts du gender

df_fr['year'].value_counts().head(16)

2014    13989
2012    13899
2013    13862
2011    13749
2015    13686
2016    13610
2017    13569
2018    13502
2010    13364
2019    13355
2020    13078
2009    12422
2008    12268
2007    12132
2006    11929
2005    11387
Name: year, dtype: int64

**Exercice n° 1**

Donnez le prénom qui a été le plus donné lors d'une année.

**Exercice n° 2**

Donnez la liste des prénoms qui contiennent dans l'ordre a, e, i, o et u (US) ou bien a, e, i et o (FR).

### Méthodes de reshaping (1)

#### pivot_table

La méthode pivot_table() prend en argument :
- values : valeurs qui doivent être agrégées selon les modalités de la colonne passée en "index" et de la colonne passée en "columns"
- index : colonne(s) dont les valeurs vont servir d'index à la table pivot
- columns : colonne(s) dont les valeurs vont servir de colonnes à la table pivot
- aggfunc : fonction d'aggrégation des values, par défaut 'mean', 'median', 'min', 'max', 'count', 'sum', 'nunique', et n'importe quelle lambda ou liste de fonctions.

On obtient NaN s'il n'y a pas d'occurence croisée.

Excel = tableau croisé dynamique.

In [83]:
# exemple
df = pd.DataFrame([{'A': 1,'B': 1, 'C': 1},
                   {'A': 1,'B': 1, 'C': 2},
                   {'A': 1,'B': 2, 'C': -1},
                   {'A': 2,'B': 1, 'C': 4},
                   {'A': 2,'B': 1, 'C': 5},
                  ])

df

   A  B  C
0  1  1  1
1  1  1  2
2  1  2 -1
3  2  1  4
4  2  1  5

In [84]:
# exemple
df.pivot_table(values='C',
              index='A',
              columns='B',
              aggfunc='mean')

B    1    2
A
1  1.5 -1.0
2  4.5  NaN

**Exercice n° 3**

Calculez une table pivot avec le nombre total de naissances par année et par genre.

**Exercice n° 4**

Calculez une table pivot avec la diversité des prénoms (nombre de prénoms distincts) par année et par genre.

#### crosstab

crosstab() est une fonction de reshaping qui prend 2 colonnes d'un DataFrame en argument et produit le décompte croisé des occurrence.

On obtient 0 s'il n'y a pas d'occurence croisée.

In [ ]:
# exemple
pd.crosstab(df['A'], df['B'])

In [ ]:
# initial
df_us['initial'] = df_us['name'].str[0].str.upper()
# terminal
df_us['terminal'] = df_us['name'].str[-1].str.upper()

df_us.head()

In [ ]:
# crosstab
pd.crosstab(df_us['initial'], df_us['terminal'], normalize=True, margins=True)*100

In [ ]:
# pivot_table
df_us.pivot_table(values='name',
                  index='initial',
                  columns='terminal',
                  aggfunc='nunique').fillna(0).astype(int)

In [ ]:
# Z x Z
df_us.loc[(df_us['initial'] == 'Z') & (df_us['terminal'] == 'Z')]

In [ ]:
# Z x Z
df_us.loc[df_us['name'].str.startswith('Z') & df_us['name'].str.endswith('z')]